# Taps
tap "glennbrown/tap"
tap "oven-sh/bun"
tap "teamookla/speedtest"
tap "valkyrie00/bbrew"

# Brew packages
brew "ansible"
brew "ansible-lint"
brew "bash"
brew "bash-completion@2"
brew "bbrew"
brew "diffutils"
brew "brotli"
brew "btop"
brew "bun"
brew "butane"
brew "cdrtools"
brew "cmake"
brew "colima"
brew "coreutils"
brew "cosign"
brew "cpio"
brew "cpufetch"
brew "diceware"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "dockutil"
brew "entr"
brew "fastfetch"
brew "ffmpeg"
brew "figurine"
brew "findutils"
brew "flac"
brew "gawk"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "htop"
brew "imagemagick"
brew "inxi"
brew "iperf3"
brew "jq"
brew "lame"
brew "lesspipe"
brew "lima-additional-guestagents"
brew "lua"
brew "lz4"
brew "macmon"
brew "mactop"
brew "mas"
brew "media-info"
brew "nano"
brew "nanorc"
brew "nmap"
brew "nvm"
brew "nvtop"
brew "p7zip"
brew "perl"
brew "pipx"
brew "pre-commit"
brew "pv"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "qemu"
brew "ruby"
brew "smartmontools"
brew "socat"
brew "speedtest"
brew "sqlite"
brew "sshpass"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "when"
brew "wifi-password"
brew "x264"
brew "x265"
brew "xz"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions", args: ["--HEAD"]
brew "zsh-history-substring-search"
brew "zstd"

# Rust Tools
brew "diffr"
brew "dua-cli"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "lsd "
brew "just"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "uv"
brew "zoxide"

# Casks
cask "1password"
cask "1password-cli"
cask "arc"
cask "autodesk-fusion"
cask "automounterhelper"
cask "balenaetcher"
cask "bbedit"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "grandperspective"
cask "keka"
cask "kekaexternalhelper"
cask "logi-options+"
cask "nordvpn"
cask "omnissa-horizon-client"
cask "raspberry-pi-imager"
cask "textual"
cask "utm"
cask "visual-studio-code"

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
mas "AmorphousDiskMark", id: 1168254295
mas "AutoMounter", id: 1160435653
mas "Balatro", id: 6502451661
mas "Broadcasts", id: 1469995354
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "HP", id: 1474276998
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "MediaInfo", id: 510620098
mas "Mela", id: 1568924476
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "Pure Paste", id: 1611378436
mas "Reeder", id: 1529448980
mas "Screens 5", id: 1663047912
mas "TestFlight", id: 899247664
mas "Text Case", id: 1492174677
mas "Tot", id: 1491071483
mas "Unread", id: 1363637349
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835