# brew taps
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "glennbrown/tap"

# Set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications"

# Casks 
cask "1password"
cask "1password-cli"
cask "balenaetcher"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "logi-options-plus"
cask "mediahuman-audio-converter"
cask "mediainfo"
cask "musicbrainz-picard"
cask "netspot"
cask "obsidian"
cask "parsec"
cask "plex"
cask "powershell"
cask "raspberry-pi-imager"
cask "spotify"
cask "timemachineeditor"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vmware-horizon-client"
cask "xquartz"

# brew packages
brew "ansible"
brew "ansible-lint"
brew "bash"
brew "bash-completion@2"
brew "btop"
brew "brew-cask-completion"
brew "coreutils"
brew "diceware"
brew "ffmpeg"
brew "findutils"
brew "flac"
brew "gawk"
brew "gnu-tar"
brew "go"
brew "htop"
brew "iperf3"
brew "jq"
brew "just"
brew "lame"
brew "lesspipe"
brew "lz4"
brew "lzo"
brew "mas"
brew "nano"
brew "nanorc"
brew "ncurses"
brew "neofetch"
brew "nmap"
brew "perl"
brew "pv"
brew "qemu"
brew "ruby"
brew "screenresolution"
brew "smartmontools"
brew "snappy"
brew "socat"
brew "speedtest-cli"
brew "sshpass"
brew "svt-av1"
brew "tmux"
brew "webp"
brew "wget"
brew "when"
brew "x264"
brew "x265"
brew "xvid"
brew "xz"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"

# Mac App Store
# Tools
mas "GoodLinks", id: 1474335294
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pure Paste", id: 1611378436
mas "HP Smart", id: 1474276998
mas "Hidden Bar", id: 1452453066
mas "Mactrack", id: 430255202
# iWork Stuff
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
# Productivity
mas "Fantastical", id: 975937182
# MS Office
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "Wipr", id: 1320666476
mas "Short Menu", id: 510109287
# Media/Home
mas "Home Assistant", id: 1099568401
mas "Mela", id: 1568924476
mas "Broadcasts", id: 1469995354
mas "Ivory", id: 6444602274
mas "Infuse", id: 1136220934
# Dev Tools
mas "Xcode", id: 497799835
mas "BBEdit", id: 404009241
