# Taps
tap "glennbrown/tap"
tap "graelo/tap"
tap "oven-sh/bun"
tap "teamookla/speedtest"
tap "valkyrie00/bbrew"
tap "hamed-elfayome/claude-usage"

# Brew packages
brew "ansible"
brew "ansible-lint"
brew "autoconf"
brew "bash"
brew "bash-completion@2"
brew "bbrew"
brew "diffutils"
brew "brotli"
brew "btop"
brew "bun"
brew "butane"
brew "ca-certificates"
brew "cdrtools"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "cosign"
brew "cpio"
brew "cpufetch"
brew "diceware"
brew "dockutil"
brew "entr"
brew "fastfetch"
brew "ffmpeg"
brew "findutils"
brew "flac"
brew "gawk"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "handbrake"
brew "htop"
brew "imagemagick"
brew "inxi"
brew "iperf3"
brew "jq"
brew "lame"
brew "lesspipe"
brew "lua"
brew "lz4"
brew "macmon"
brew "mactop"
brew "mas"
brew "media-info"
brew "nano"
brew "nanorc"
brew "nmap"
brew "nvm"
brew "nvtop"
brew "openssl@3"
brew "openssl@4"
brew "p7zip"
brew "perl"
brew "php"
brew "pipx"
brew "pre-commit"
brew "pumas"
brew "pv"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "qemu"
brew "ruby"
brew "smartmontools"
brew "socat"
brew "speedtest"
brew "sqlite"
brew "sshpass"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "wget"
brew "when"
brew "x264"
brew "x265"
brew "xz"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions", args: ["--HEAD"]
brew "zsh-history-substring-search"
brew "zstd"

# Rust Tools
brew "bat" # cat replacement
brew "diffr" # Modern diff
brew "difftastic" # Modern diff
brew "dua-cli" # Modern du
brew "duf" # Modern Unix df
brew "dust" # Modern du
brew "eza" # ls replacement
brew "fd" # Find replacement
brew "fzf" # Fuzzy finder
brew "lsd " # ls replacement
brew "procs" # Rust replacement for ps
brew "just" # Command runner
brew "ripgrep" # Fast grep
brew "starship" # Prompt bling
brew "tealdeer" # Rust re-write of tldr which are community based manpages
brew "topgrade" # Upgrade all the things
brew "uutils-coreutils" # Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-diffutils" # Cross-platform Rust rewrite of the GNU diffutils
brew "uutils-findutils" # Cross-platform Rust rewrite of the GNU findutils
brew "uv" # Pip/virtualenv replacement
brew "zoxide" # Smart cd replacement

# Casks
cask "1password"
cask "1password-cli"
cask "affinity"
cask "appcleaner"
cask "automounterhelper"
cask "balenaetcher"
cask "bambu-studio"
cask "bbedit"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code@latest"
cask "claude-usage-tracker"
cask "coconutbattery"
cask "crystalfetch"
cask "db-browser-for-sqlite"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "grandperspective"
cask "handbrake-app"
cask "hazel"
cask "hyperkey"
cask "iina"
cask "keka"
cask "kekaexternalhelper"
cask "latest"
cask "logi-options+"
cask "mediahuman-audio-converter"
cask "netnewswire"
cask "nordvpn"
cask "omnissa-horizon-client"
cask "plex"
cask "raspberry-pi-imager"
cask "raycast"
cask "reminders-menubar"
cask "sf-symbols"
cask "tailscale-app"
cask "textual"
cask "thaw"
cask "timemachineeditor"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "zed"

# Mac App Store apps
mas "1Password for Safari", id: 1569813296
mas "AmorphousDiskMark", id: 1168254295
mas "Apple Configurator", id: 1037126344
mas "AutoMounter", id: 1160435653
mas "Balatro", id: 6502451661
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Broadcasts", id: 1469995354
mas "GarageBand", id: 682658836
mas "GoodLinks", id: 1474335294
mas "Home Assistant", id: 1099568401
mas "HP", id: 1474276998
mas "Hyperspace", id: 6739505345
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "Itsyhome", id: 6758070650
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "MediaInfo", id: 510620098
mas "Mela", id: 1568924476
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "Reeder", id: 1529448980
mas "Screens 5", id: 1663047912
mas "TestFlight", id: 899247664
mas "Text Case", id: 1492174677
mas "Tot", id: 1491071483
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
